import numpy as np


class DataProvider:
    def __init__(self):
        self.datasets = {
            "Набір 1 (5 точок)": (
                np.array([1, 2, 3, 4, 5]),
                np.array([1.1, 1.4, 1.7, 2.1, 2.3])
            ),
            "Набір 2 (10 точок)": (
                np.array([1, 2, 3, 4, 5, 6, 7, 8]),
                np.array([1, 1.41, 1.73, 2.0, 2.24, 2.45, 2.65, 2.83])
            ),
            "Набір 3 (20 точок)": (
                np.array([0, 0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5,
                          5.0, 5.5, 6.0, 6.5, 7.0, 7.5, 8.0, 8.5, 9.0, 9.5]),
                np.array([2.0, 2.1, 1.9, 2.3, 1.8, 2.4, 1.7, 2.5, 1.6, 2.6,
                          1.5, 2.7, 1.4, 2.8, 1.3, 2.9, 1.2, 3.0, 1.1, 3.1])
            )
        }

    def get_data(self, name):
        return self.datasets.get(name, self.datasets["Набір 1 (5 точок)"])